[SkirmisherReturnFire X2AbilityTemplate]
LocFriendlyName = "Return Fire"
LocFlyOverText = "Return Fire"
LocHelpText = "Up to three times per turn, automatically fire back with your <Ability:WeaponName/> when targeted by an enemy attack."
LocLongDescription = "Up to three times per turn, automatically fire back with your <Ability:WeaponName/> when targeted by an enemy attack."
LocPromotionPopupText = "<Bullet/> Return Fire can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire will not trigger when targeted by Overwatch fire.<br/>"

[SkirmisherReflex X2AbilityTemplate]
LocFriendlyName="Reflex"
LocLongDescription="When fired upon, gain one extra action on the next turn. This does not stack."
LocHelpText="When fired upon, gain one extra action on the next turn. This does not stack."
LocFlyoverText="Reflex: +1 Action Next Turn"
LocPromotionPopupText="<Bullet/> The Grapple makes the Skirmisher a great advance scout, and Reflex rewards their aggressive positioning.<br/>"

[SkirmisherVengeance X2AbilityTemplate]
LocFriendlyName="Wrath"
LocLongDescription="Use the Grapple to pull yourself to an enemy and deliver a <Ability:SecondaryWeaponName/> strike that deals additional damage."
LocHelpText="Use the Grapple to pull yourself to an enemy and deliver a <Ability:SecondaryWeaponName/> strike that deals additional damage."
LocPromotionPopupText="<Bullet/> Wrath adds extra mobility for the Skirmisher, and can be used while the Grapple is on cooldown.<br/><Bullet/> The <Ability:SecondaryWeaponName/> strike is guaranteed to hit if the Grapple is successful.<br/><Bullet/> An open space adjacent to the enemy is needed to use Wrath.<br/><Bullet/> Wrath has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[WrathDamageBuff X2AbilityTemplate]
LocFriendlyName="Pounce"
LocLongDescription="Wrath deals 2 additional damage."
LocHelpText="Wrath deals 2 additional damage."
LocPromotionPopupText="<Bullet/> <br/>"

[ZeroIn X2AbilityTemplate]
LocFriendlyName="Zero In"
LocLongDescription="Each attacks on the same turn provide +5 hit and +10 critical chance that can be stacked."
LocHelpText="Each attacks on the same turn provide +5 hit and +10 critical chance that can be stacked."
LocFlyoverText="Zero In"
LocPromotionPopupText="<Bullet/> The Skirmisher's ability to accrue many actions per turn can result in massive bonuses from Zero In.<br/><Bullet/> Other offensive abilities like Ripjack attack and Whiplash can trigger and get Zero In bonuses as well as Standard Shot can.<br/>"

[FullThrottle X2AbilityTemplate]
LocFriendlyName="Full Throttle"
LocLongDescription="Immediately get a bonus move. It does not cost an action."
LocHelpText="Immediately get a bonus move. It does not cost an action."
LocFlyoverText="Full Throttle"
LocPromotionPopupText="<Bullet/> .<br/><Bullet/> Full Throttle has 6 turn cooldown.<br/>"

[SkirmisherInterrupt X2AbilityTemplate]
LocFriendlyName="Interrupt"
LocLongDescription="A powerful form of Overwatch, Instead of firing automatically, stun an enemy for single action and perform any single action."
LocHelpText="A powerful form of Overwatch, Instead of firing automatically, stun an enemy for single action and perform any single action."
LocFlyoverText="Interrupt"
LocPromotionPopupText="<Bullet/> Some actions are not available during Interrupt, like Overwatch.<br/>"

[SkirmisherInterruptInput X2AbilityTemplate]
LocFriendlyName="Interrupt"
LocLongDescription="A powerful form of Overwatch, Instead of firing automatically, stun an enemy for single action and perform any single action."
LocHelpText="A powerful form of Overwatch, Instead of firing automatically, stun an enemy for single action and perform any single action."
LocFlyoverText="Interrupt"
LocPromotionPopupText="<Bullet/> Some actions are not available during Interrupt, like Overwatch.<br/>"

[ManualOverride X2AbilityTemplate]
LocFriendlyName="Manual Override"
LocLongDescription="Lower all ability cooldowns to 1."
LocHelpText="Lower all ability cooldowns to 1."
LocPromotionPopupText="<Bullet/> Use the Skirmisher's abilities early and often to take full advantage of Manual Override.<br/><Bullet/> Manual Override has 6 turn cooldown.<br/>"

[Battlelord X2AbilityTemplate]
LocFriendlyName="Battlelord"
LocLongDescription="After each enemy in line of sight takes a turn, take an immediate action."
LocHelpText="After each enemy in line of sight takes a turn, take an immediate action."
LocFlyoverText="Battlelord"
LocPromotionPopupText="<Bullet/> Battlelord can allow the Skirmisher to prevail in the most dire of circumstances.<br/><Bullet/> While Skirmisher is in the effect of Battlelord, enemy's attack toward them will reduces all ability cooldowns by one. <br/><Bullet/> Battlelord can only used once per turn.<br/><Bullet/> Turns from the Lost and enemy pod reveals do not grant the immediate action.<br/>"

[Parkour X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="This unit takes an non-movement action after the first move of the turn."
LocHelpText="This unit takes an non-movement action after the first move of the turn."

[ParkourPassive X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="This unit takes an non-movement action after the first move of the turn."
LocHelpText="This unit takes an non-movement action after the first move of the turn."

[ParkourUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Skirmisher: Parkour"
Summary="This unit takes an non-movement action after the first move of the turn."

[SKR_TotalCombat X2AbilityTemplate]
LocFriendlyName="Total Combat"
LocLongDescription="Firing a standard shot, throwing a grenade or using an item no longer ends the turn."
LocHelpText="Firing a standard shot, throwing a grenade or using an item no longer ends the turn."
LocPromotionPopupText="<Bullet/> Total Combat adds even more flexibility to the Skirmisher's turns, allowing actions to be taken exactly when needed.<br/>"

[SKR_BulletTime X2AbilityTemplate]
LocFriendlyName="Bullet Time"
LocLongDescription="Your evasive maneuver allows you to avoid critically hit and reduce damage by grazing shot."
LocHelpText="Your evasive maneuver allows you to avoid critically hit and reduce damage by grazing shot."
LocFlyoverText="Bullet Time!"
LocPromotionPopupText="<Bullet/> Bullet Time allow the Skirmisher to keep their agressive position with less risk.<br/><Bullet/> Enemy suffers -50 critical chance penalty when targets the Skirmisher, and you can reduce grazing damage by 3.<br/><Bullet/> Damage cannot be reduced under 1.<br/>"

[SKR_Optimization X2AbilityTemplate]
LocFriendlyName="Optimization"
LocLongDescription="Reaction attacks can critically hit and receive Zero In bonuses you earn from last turn."
LocHelpText="Reaction attacks can critically hit and receive Zero In bonuses you earn from last turn."
LocFlyoverText="Optimized"
LocPromotionPopupText="<Bullet/> By sustaining Zero In bonuses to enemy turn, reaction attacks will be more deadly.<br/><Bullet/> Still reaction attacks can't increase Zero In counter.<br/><Bullet/> Interrupting actions like Interrupt or Battlelord can't take advantage of Optimization.<br/>"

[SKR_Tuning X2AbilityTemplate]
LocFriendlyName="Tuning"
LocLongDescription="<Ability:WeaponName/> deals +1 extra damage and its clipsize increased by 4. Also <Ability:SecondaryWeaponName/> deals +1 extra damage and have +20 critical chance."
LocHelpText="<Ability:WeaponName/> deals +1 extra damage and its clipsize increased by 4. Also <Ability:SecondaryWeaponName/> deals +1 extra damage and have +20 critical chance."
LocPromotionPopupText="<Bullet/> By modification primary and secondary weapon, Skirmisher's damage dealing potential is significantly increased.<br/>"

[SKR_ShotGrouping X2AbilityTemplate]
LocFriendlyName="Shot Grouping"
LocLongDescription="Missed shot deals 2 damage."
LocHelpText="Missed shot deals 2 damage."
LocPromotionPopupText="<Bullet/> <br/>"

[SKR_DeepPockets X2AbilityTemplate]
LocFriendlyName="Deep Pockets"
LocHelpText="All limited-use items in your inventory receive 1 extra use."
LocLongDescription="All limited-use items in your inventory receive 1 extra use."
LocPromotionPopupText="<Bullet/> One-time-use items, such as the Refraction Field or Overdrive Serum, will not get any additional charges from this ability.<br/>"

;this doesn't anything at this time
[X2Ability_ReworkedSkirmisherPerkPack]
sTacticalAnalysisFlyoverText = "Tactical Analysis"
sTacticalAnalysisWorldMessageText = "<XGParam:StrValue0/!UnitName/> halt their action due to Interrupt."
